---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.HostForCutHasNoGeometry
source: html/66f5c45e-9b46-6bde-a95e-21291121ddba.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.HostForCutHasNoGeometry Property

Host can't be cut because it has no geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostForCutHasNoGeometry { get; }
```